"""
5. การทํางานทําซ้ํา เพื่อคํานวณภาษี ของรายได้ทั้งปีสอบถามจํานวนที่ต้องการคํานวณภาษี จากนั้น
ระบุรายได้ภาษี(บาท) แล้วแสดงภาษีที่ต้องจ่าย จํานวนรอบเท่ากับที่ระบุ โดยมีเงื่อนไขคิดภาษี
ดังนี้ ถ้า มีรายได้ต่อปี น้อยกว่า 2 แสนไม่ต้องจ่ายภาษี 
ถ้า มีรายได้ต่อปีตั้งแต่ 2 แสนบาทขึ้นไป ให้คํานวณภาษีที่ต้องจ่าย 5 % ของรายได้
"""

round = int(input("ระบุจำนวนรอบของรายได้ที่ต้องการคำนวณภาษี : ")); 
totalForIncome = 0; 
netIncome = 0; 
tax = 0; 
for i in range(1,round+1):
    roundForIncome = int(input(f"รอบที่ {i}|{round} คุณมีรายได้ : "))
    totalForIncome += roundForIncome

if totalForIncome >200000 :
    tax = totalForIncome * 0.05 
    netIncome = totalForIncome - tax 

print("__________________________________________________________")
print(f"คุณมีรายได้จำนวน {totalForIncome:.2f} บาท มีภาษีที่ต้องจ่าย {tax:.2f} บาท"); 
print(f"รายได้สุทธิหลังจากหักภาษีแล้ว {netIncome:.2f} บาท"); 